export interface Article {
  id: string;
  name: string;
  number: number;
  content: string;
}

export const mockArticles: Article[] = [
  {
    "id": "1753798685866",
    "name": "Η Ελληνική Ομοσπονδία",
    "number": 1,
    "content": "<p>Ο Λαός και οι Περιφέρειες της Ανατολικής Μακεδονίας και Θράκης, της Κεντρικής Μακεδονίας, της Δυτικής Μακεδονίας, της Ηπείρου, της</p><p>Θεσσαλίας, των Ιονίων Νήσων, της Δυτικής Ελλάδας, της Στερεάς Ελλάδας, της Αττικής, της Πελοποννήσου, του Βορείου Αιγαίου, του Νοτίου</p><p>Αιγαίου και της Κρήτης, συγκροτούν την Ελληνική Ομοσπονδία.</p>"
  },
  {
    "id": "1753798703627",
    "name": "Στόχοι",
    "number": 2,
    "content": "<ol class=\"order_class\"><li><p>Η Ελληνική Ομοσπονδία προστατεύει την ελευθερία και τα δικαιώματα του λαού και διασφαλίσει την ανεξαρτησία και την ασφάλεια της χώρας.</p></li><li><p>Θα πρέπει να προωθεί την κοινή ευημερία, τη βιώσιμη ανάπτυξη, την εσωτερική συνοχή και την πολιτιστική ποικιλομορφία της χώρας.</p></li><li><p>Θα πρέπει να διασφαλίζει τη μέγιστη δυνατή ισότητα ευκαιριών μεταξύ των πολιτών του.</p></li><li><p>Έχει δεσμευτεί για τη μακροπρόθεσμη διατήρηση των φυσικών πόρων και για μια δίκαιη και ειρηνική διεθνή τάξη.</p></li></ol><p></p>"
  },
  {
    "id": "1753798725162",
    "name": "Περιφέρειες",
    "number": 3,
    "content": "<p>Οι Περιφέρειες είναι κυρίαρχες εκτός από το βαθμό που η κυριαρχία τους περιορίζεται από το Ομοσπονδιακό Σύνταγμα. Ασκούν όλα τα</p><p>δικαιώματα που δεν ανήκουν στην Ομοσπονδία.</p>"
  },
  {
    "id": "1753801782529",
    "name": "Εθνική Γλώσσα",
    "number": 4,
    "content": "<p>Η εθνική γλώσσα της Ελλάδας είναι τα Νέα Ελληνικά.</p>"
  },
  {
    "id": "1753798757416",
    "name": "Κράτος Δικαίου",
    "number": 5,
    "content": "<ol><li><p>Όλες οι δραστηριότητες του κράτους βασίζονται σε νόμο και περιορίζονται από αυτόν.</p></li><li><p>Οι κρατικές δραστηριότητες πρέπει να διεξάγονται προς το δημόσιο συμφέρον και να είναι ανάλογες με τους επιδιωκόμενους σκοπούς.</p></li><li><p>Οι κρατικοί φορείς και οι ιδιώτες οφείλουν να ενεργούν καλή τη πίστει.</p></li><li><p>Η Ομοσπονδία και οι Περιφέρειες οφείλουν να σέβονται το διεθνές δίκαιο.</p></li></ol><p></p>"
  },
  {
    "id": "1753801953986",
    "name": "Επικουρικότητα",
    "number": 6,
    "content": "<p>Η αρχή της επικουρικότητας πρέπει να τηρείται κατά την κατανομή και την εκτέλεση των κρατικών καθηκόντων.</p>"
  },
  {
    "id": "1753801967926",
    "name": "Ατομική και συλλογική ευθύνη",
    "number": 7,
    "content": "<p>Όλα τα άτομα αναλαμβάνουν την ευθύνη για τον εαυτό τους και, ανάλογα με τις ικανότητές τους, συμβάλλουν στην επίτευξη των καθηκόντων του κράτους και της κοινωνίας.</p>"
  }
];
